[{"url":"https:\/\/www.target.com\/p\/allegra-k-women-s-chunky-heel-lace-up-zipper-combat-boots\/-\/A-85781566","tcin":"85781566","upc":"782685948357","price_amount":62.99,"currency":"USD","description":"Read reviews and buy Allegra K Women's Chunky Heel Lace Up Zipper Combat Boots at Target. Choose from Same Day Delivery, Drive Up or Order Pickup. Free standard shipping with $35 orders. Expect More. Pay Less.","specs":null,"ingredients":"[]","bullets":" Vamp: PU; Outsole: TPR; Heel: ABS\n Low Platform, Round Toe, Padded Insole, Lug Sole; Chunky Heel, Lace Up Decor, Side Zipper\n Occasion: Office, Interview, Party, Casual, Halloween days, Christmas Days, Evening\n Good choice for halloween costumes and role playing\n Red, Black, Burgundy, Leopard Print: Heel Height: 2 1\/8 inches; Coffee Color: Heel Height: 3 1\/2 inches, Platform Height: 1 3\/8 inches; ShaftHeight: 3 7\/8 inches","features":"['Sizing: Womens', 'Care and Cleaning: Spot or Wipe Clean', 'Footwear Insole Material: 100% Polyurethane', 'Features: Zipper', 'Footwear Lining Material: 100% Polyester', 'Toe Style: Round Toe', 'Footwear Upper Material: 100% Faux Leather', 'Heel: Approximately 2.0 Inches Block Heel', 'Footwear Outsole Material: 100% TPR (Thermoplastic Rubber)', 'Theme: Cozy', 'Footwear toe openness: Closed Toe', 'Shoe Width: Medium']"},{"url":"https:\/\/www.target.com\/p\/good-humor-strawberry-shortcake-frozen-dessert-bars-6pk\/-\/A-13493042","tcin":"13493042","upc":"041000053153","price_amount":5.49,"currency":"USD","description":"Read reviews and buy Good Humor Strawberry Shortcake Frozen Dessert Bars - 6pk at Target. Choose from Same Day Delivery, Drive Up or Order Pickup. Free standard shipping with $35 orders. Expect More. Pay Less.","specs":null,"ingredients":"[]","bullets":"Good Humor Strawberry Shortcake Frozen Dairy Dessert Bar is a delicious combination of a creamy vanilla frozen dairy dessert and a strawberry core with a signature cake coating.\nAmerica's favorite strawberry shortcake bar, this strawberry dessert is a delicious dessert for any time.\nThis classic frozen treat is covered with Good Humor's signature strawberry shortcake cake coating.\nThere are six frozen dessert bars in each box, making this the perfect treat for sharing with friends and family.\nThe dairy in our delicious Strawberry Shortcake Frozen Dairy Dessert Bar is certified kosher.\nGood Humor has been creating great tasting, high-quality ice cream and frozen dessert for the family since 1920.","features":"['Contains: Soy, Milk, Coconut, Wheat', 'Form: Bar', 'Package Quantity: 6', 'Net weight: 18 fl oz (US)']"},{"url":"https:\/\/www.target.com\/p\/baby-trend-expedition-race-tec-jogger-travel-system-8211-ultra-gray\/-\/A-79344798","tcin":"79344798","upc":"090014028541","price_amount":279.99,"currency":"USD","description":"Read reviews and buy Baby Trend Expedition Race Tec Jogger Travel System &#8211; Ultra Gray at Target. Choose from Same Day Delivery, Drive Up or Order Pickup. Free standard shipping with $35 orders. Expect More. Pay Less.","specs":null,"ingredients":"[]","bullets":"Suggested Age: Newborn to 5 years\nCar Seat Stage: Rear-facing from 4-35 pounds and up to 32 inches\nCar Seat Safety Features: Recline leveling system with dual bubble level indicators, 5-Point Adjustable Harness with one-hand adjustment, 6-position crotch belt adjustment, EPS Energy absorbing foam\nStroller Seat Adjustments: Comfort Cabin with extra-large UPF 50+ canopy with extended sun visor and Peek-A-Boo window.  Enhanced quick release front wheel for improved stability and safety (Upgrade wheel design compared to our Cityscape Jogger, Pathway Jogger, and Expedition Jogger)\nIncludes: RaceTec Jogger Stroller and car seat combination, Allyâ\u0084¢ Infant Car Seat and Base, and extra-large basket with rear access to hold parentâ\u0080\u0099s key essentials\nIncludes:  Modern designed parent console with cell phone positioner and 2 deep cup holders.  Swing away child tray with 2 cup holders makes getting child in and out of the stroller easily","features":"['Dimensions (Overall): 41 Inches (H) x 24 Inches (W) x 48 Inches (D)', 'Weight: 24.92 Pounds', 'Dimensions (Collapsed): 18 Inches (H) x 24 Inches (W) x 36 Inches (D)', 'Suggested Age: 0-5 Years', 'Front Wheel Diameter: 12 Inches', 'Rear Wheel Diameter: 16 Inches', 'Features: Infant Car Seat Compatible, Adjustable Handle, LATCH Compatible', 'Min. Carseat Weight Supported: 4 Pounds', 'Max. Stroller Weight Capacity: 50 Pounds', 'Max. Carseat Weight Capacity: 35 Pounds', 'Assembly Details: Adult Assembly Required, Tools Not Provided', 'Includes: Car Seat Base', 'Product Configuration: Single', 'Industry or Government Certifications: JPMA Certified', 'Tire Type: EVA', 'Material: Metal, Plastic, Polyester', 'Battery: No Battery Used', 'Care & Cleaning: Spot or Wipe Clean', \"Warranty: 1 Year Limited Warranty. To obtain a copy of the manufacturer's or supplier's warranty for this item prior to purchasing the item, please call Target Guest Services at 1-800-591-3869\"]"}]